app/controllers/bitcoin_prices_controller.rb

INSERT INTO "bitcoin_prices" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 06 Jan 2014 00:52:51 UTC +00:00], ["updated_at", Mon, 06 Jan 2014 00:52:51 UTC +00:00]]
---
  def create
    @bitcoin_price = BitcoinPrice.new(bitcoin_price_params)

    respond_to do |format|
      if @bitcoin_price.save

SELECT "bitcoin_prices".* FROM "bitcoin_prices" WHERE "bitcoin_prices"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_bitcoin_price
      @bitcoin_price = BitcoinPrice.find(params[:id])